# Learn Pandas
Date: 29 October 2022

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print(pd.__version__)

1.4.2

In [2]:
data_dict = {'Name' : ['Sumit Tyagi', 'Sukritin',
                  'Akriti Goel', 'Sanskriti',
                  'Abhishek Jain'],
        'Age':[22, 20, 45, 21, 22],
        'Marks':[90, 84, 33, 87, 82]}
data = pd.DataFrame(data_dict)
print(data)

            Name  Age  Marks
0    Sumit Tyagi   22     90
1       Sukritin   20     84
2    Akriti Goel   45     33
3      Sanskriti   21     87
4  Abhishek Jain   22     82

In [3]:
learn_group = pd.DataFrame(
    {'Movie': ["Titanic", "Black Gold", "Titanic", "Titanic", "Black Gold"],
 'Rating': [5, 4, 2, 4, 5]
    })

print(learn_group)
print()
print()
group_count = pd.DataFrame(learn_group.groupby(["Movie"])["Rating"].count())
print(group_count)
print()
print()
group_agg = pd.DataFrame(learn_group.groupby(["Movie"])["Rating"].agg(['count','sum', 'mean']))
print(group_agg)

        Movie  Rating
0     Titanic       5
1  Black Gold       4
2     Titanic       2
3     Titanic       4
4  Black Gold       5


            Rating
Movie
Black Gold       2
Titanic          3


            count  sum      mean
Movie
Black Gold      2    9  4.500000
Titanic         3   11  3.666667

In [4]:
n = 3
first_n_column = data.iloc[:, :3]
print(group_agg.describe())

          count        sum      mean
count  2.000000   2.000000  2.000000
mean   2.500000  10.000000  4.083333
std    0.707107   1.414214  0.589256
min    2.000000   9.000000  3.666667
25%    2.250000   9.500000  3.875000
50%    2.500000  10.000000  4.083333
75%    2.750000  10.500000  4.291667
max    3.000000  11.000000  4.500000

In [5]:
d.Age.values.tolist()

NameError: name 'd' is not defined

In [ ]:
# Data Type
dataset = {
    "cars": ["Toyota", "BMW"],
    "engine": 2
}
var_data = pd.DataFrame(dataset)

print(var_data)
var_data.describe()

In [ ]:
dats_series = [1,2,4]
pd.Series(dats_series)

In [ ]:
pd.options.display.max_rows = 9999

df = pd.read_csv('addresses.csv')

df.head()
df.info()
df.describe()

In [ ]:
df = pd.DataFrame(np.random.randn(10,6))
df

In [ ]:
data = {
  "calories": [20, 20, 390],
  "duration": [20, 10, 45]
}
df = pd.DataFrame(data)
df
print(df)
df.drop_duplicates(inplace = True)
print("____________________________________________")
print("______________Remove Duplicate______________")
print("____________________________________________")
print(df)

# Plot

In [ ]:
df = pd.read_csv('data.csv')
df.plot()
plt.show()

df.plot(kind = 'scatter', x = 'Duration', y = 'Calories')

## Correlation Coefficient

In [ ]:
data_score = pd.read_csv("exam_scores.csv")
data_score.head()

In [ ]:
data_score.describe()
data_score.corr()
correlation = data_score.corr()
print(correlation.loc['History', 'English'])

 Show Selected Column

In [ ]:
columns = pd.DataFrame(np.array([[3, 2, 4], [4, 5, 2], [2, 1, 6]]),
                   columns=['UserID', 'placeID', 'Rating'])

s_column = selected_column[['UserID', 'placeID']]
print(s_column)

In [ ]:
# Merge Table

product_data = {
    'product_id' : [1,2,3],
    'product_name': ['Laptop', 'printer', 'tablet']
}

price_table = {'product_id': [1,2,3],
        'price': [1200, 150, 'NaN']
        }
price_table_df = pd.DataFrame(price_table)
product_data_df = pd.DataFrame(product_data)


pivot_table = pd.merge(product_data_df, price_table_df, on="product_id")
pivot_table

In [ ]:
# Pivot Table

df = pd.DataFrame({'Student Names' : ['Jenny', 'Singh', 'Charles', 'Richard', 'Veena'],
                   'Category' : ['Online', 'Offline', 'Offline', 'Offline', 'Online'],
                   'Gender' : ['Female', 'Male', 'Male', 'Male', 'Female'],
                  'Courses': ['Java', 'Spark', 'PySpark','Hadoop','C'],
                   'Fee': [15000, 17000, 27000, 29000, 12000],
                   'Discount': [1100, 800, 1000, 1600, 600]})

print('____________________')
p_table = pd.pivot_table(df, index=['Gender'], fill_value = 0, aggfunc = ['sum', 'mean']) 
print(p_table)

In [ ]:
# Learn ML Modeling

from sklearn.model_selection import train_test_split
X, y = np.arange(10).reshape((5, 2)), range(5)
X
print(X)
print(y)
print(list(y))
print()
print()

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)
print(X_train)
print('___________')
print(X_test)
print('___________ y_train')
print(y_train)
print('___________ y_test')
print(y_test)

In [ ]:
# https://www.learndatasci.com/tutorials/python-pandas-tutorial-complete-introduction-for-beginners/
# Date: 09 December 2022

In [21]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 3, 7, 2],
    'oranges': [0, 3, 7, 2]
}
purchases = pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [23]:
temp_df = purchases.append(purchases)
temp_df

/tmp/ipykernel_1243338/869578487.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  temp_df = purchases.append(purchases)

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2
0       3        0
1       2        3
2       0        7
3       1        2

In [26]:
temp_df = temp_df.drop_duplicates()
temp_df

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [13]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David'])
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [14]:
purchases.loc['June']

apples     3
oranges    0
Name: June, dtype: int64